------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ulaseraslan/Desktop/ulaseraslan_25058_ps5.log
  log type:  text
 opened on:  10 Jan 2021, 17:57:59

. use "/Users/ulaseraslan/Desktop/airfare.dta"

. reg lpassen lfare ldistsq y00 y99 y98 ldist 

      Source |       SS           df       MS      Number of obs   =     4,596
-------------+----------------------------------   F(6, 4589)      =     52.48
       Model |  230.557732         6  38.4262887   Prob > F        =    0.0000
    Residual |  3360.12968     4,589  .732213921   R-squared       =    0.0642
-------------+----------------------------------   Adj R-squared   =    0.0630
       Total |  3590.68741     4,595  .781433605   Root MSE        =    .85569

------------------------------------------------------------------------------
     lpassen |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lfare |  -.5647711   .0369644   -15.28   0.000    -.6372392   -.4923031
     ldistsq |   .1227088   .0247935     4.95   0.000     .0741017     .171316
         y00 |   .1380369   .0358761     3.85   0.000     .0677024    .2083713
         y99 |    .081651    .035724     2.29   0.022     .0116148    .1516873
         y98 |   .0321212   .0357118     0.90   0.368    -.0378911    .1021335
       ldist |   -1.54939   .3265076    -4.75   0.000    -2.189502   -.9092778
       _cons |   13.65144   1.094166    12.48   0.000     11.50635    15.79653
------------------------------------------------------------------------------

. xtreg lpassen lfare ldistsq ldist y98 y99 y00, fe
note: ldistsq omitted because of collinearity
note: ldist omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,596
Group variable: id                              Number of groups  =      1,149

R-sq:                                           Obs per group:
     within  = 0.4507                                         min =          4
     between = 0.0487                                         avg =        4.0
     overall = 0.0574                                         max =          4

                                                F(4,3443)         =     706.35
corr(u_i, Xb)  = -0.3249                        Prob > F          =     0.0000

------------------------------------------------------------------------------
     lpassen |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lfare |  -1.155039   .0227645   -50.74   0.000    -1.199672   -1.110406
     ldistsq |          0  (omitted)
       ldist |          0  (omitted)
         y98 |   .0464889   .0059898     7.76   0.000     .0347449    .0582329
         y99 |   .1023612   .0060174    17.01   0.000     .0905631    .1141592
         y00 |   .1946548   .0063513    30.65   0.000     .1822021    .2071075
       _cons |   11.81677   .1151921   102.58   0.000     11.59092    12.04262
-------------+----------------------------------------------------------------
     sigma_u |  .89829067
     sigma_e |  .14295339
         rho |   .9753002   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(1148, 3443) = 141.20                Prob > F = 0.0000

. reg lfare concen y98 y99 y00 ldist ldistsq

      Source |       SS           df       MS      Number of obs   =     4,596
-------------+----------------------------------   F(6, 4589)      =    523.18
       Model |  355.453858         6  59.2423096   Prob > F        =    0.0000
    Residual |  519.640516     4,589  .113236112   R-squared       =    0.4062
-------------+----------------------------------   Adj R-squared   =    0.4054
       Total |  875.094374     4,595  .190444913   Root MSE        =    .33651

------------------------------------------------------------------------------
       lfare |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      concen |   .3601203   .0300691    11.98   0.000     .3011705    .4190702
         y98 |   .0211244   .0140419     1.50   0.133    -.0064046    .0486533
         y99 |   .0378496   .0140413     2.70   0.007      .010322    .0653772
         y00 |     .09987   .0140432     7.11   0.000     .0723385    .1274015
       ldist |  -.9016004    .128273    -7.03   0.000    -1.153077   -.6501235
     ldistsq |   .1030196   .0097255    10.59   0.000     .0839529    .1220863
       _cons |   6.209258   .4206247    14.76   0.000     5.384631    7.033884
------------------------------------------------------------------------------

. predict lfarehat
(option xb assumed; fitted values)

. reg lpassen lfarehat y00 y99 y98 ldist ldistsq

      Source |       SS           df       MS      Number of obs   =     4,596
-------------+----------------------------------   F(6, 4589)      =     24.37
       Model |  110.891091         6  18.4818484   Prob > F        =    0.0000
    Residual |  3479.79632     4,589  .758290766   R-squared       =    0.0309
-------------+----------------------------------   Adj R-squared   =    0.0296
       Total |  3590.68741     4,595  .781433605   Root MSE        =     .8708

------------------------------------------------------------------------------
     lpassen |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lfarehat |  -1.776549   .2160716    -8.22   0.000    -2.200153   -1.352945
         y00 |   .2542695   .0418265     6.08   0.000     .1722695    .3362696
         y99 |   .1241675   .0371132     3.35   0.001     .0514079    .1969272
         y98 |   .0616171   .0367093     1.68   0.093    -.0103508    .1335851
       ldist |  -2.498972   .3717581    -6.72   0.000    -3.227797   -1.770147
     ldistsq |   .2314933   .0316459     7.32   0.000     .1694521    .2935344
       _cons |   21.21249   1.732746    12.24   0.000     17.81547     24.6095
------------------------------------------------------------------------------

. ivreg lpassen y00 y99 y98 ldist ldistsq (lfare= concen)

Instrumental variables (2SLS) regression

      Source |       SS           df       MS      Number of obs   =     4,596
-------------+----------------------------------   F(6, 4589)      =     20.45
       Model | -556.334915         6 -92.7224858   Prob > F        =    0.0000
    Residual |  4147.02233     4,589  .903687586   R-squared       =         .
-------------+----------------------------------   Adj R-squared   =         .
       Total |  3590.68741     4,595  .781433605   Root MSE        =    .95062

------------------------------------------------------------------------------
     lpassen |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lfare |  -1.776549   .2358788    -7.53   0.000    -2.238985   -1.314113
         y00 |   .2542695   .0456607     5.57   0.000     .1647525    .3437865
         y99 |   .1241675   .0405153     3.06   0.002      .044738    .2035971
         y98 |   .0616171   .0400745     1.54   0.124    -.0169481    .1401824
       ldist |  -2.498972   .4058371    -6.16   0.000    -3.294607   -1.703336
     ldistsq |   .2314932   .0345468     6.70   0.000     .1637648    .2992216
       _cons |   21.21249   1.891586    11.21   0.000     17.50407     24.9209
------------------------------------------------------------------------------
Instrumented:  lfare
Instruments:   y00 y99 y98 ldist ldistsq concen
------------------------------------------------------------------------------

. clear

. use "/Users/ulaseraslan/Desktop/FERTIL2.DTA"

. reg children educ age agesq

      Source |       SS           df       MS      Number of obs   =     4,361
-------------+----------------------------------   F(3, 4357)      =   1915.20
       Model |  12243.0295         3  4081.00985   Prob > F        =    0.0000
    Residual |  9284.14679     4,357  2.13085765   R-squared       =    0.5687
-------------+----------------------------------   Adj R-squared   =    0.5684
       Total |  21527.1763     4,360  4.93742577   Root MSE        =    1.4597

------------------------------------------------------------------------------
    children |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0905755   .0059207   -15.30   0.000     -.102183   -.0789679
         age |   .3324486   .0165495    20.09   0.000     .3000032     .364894
       agesq |  -.0026308   .0002726    -9.65   0.000    -.0031652   -.0020964
       _cons |  -4.138307   .2405942   -17.20   0.000    -4.609994    -3.66662
------------------------------------------------------------------------------

. reg educ frsthalf age agesq

      Source |       SS           df       MS      Number of obs   =     4,361
-------------+----------------------------------   F(3, 4357)      =    175.21
       Model |  7238.42472         3  2412.80824   Prob > F        =    0.0000
    Residual |   60001.141     4,357  13.7712052   R-squared       =    0.1077
-------------+----------------------------------   Adj R-squared   =    0.1070
       Total |  67239.5657     4,360  15.4219187   Root MSE        =     3.711

------------------------------------------------------------------------------
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    frsthalf |  -.8522854   .1128296    -7.55   0.000    -1.073489   -.6310821
         age |  -.1079504   .0420402    -2.57   0.010    -.1903706   -.0255302
       agesq |  -.0005056   .0006929    -0.73   0.466    -.0018641    .0008529
       _cons |   9.692864   .5980686    16.21   0.000     8.520346    10.86538
------------------------------------------------------------------------------

. predict educhat
(option xb assumed; fitted values)

. reg children educhat age agesq

      Source |       SS           df       MS      Number of obs   =     4,361
-------------+----------------------------------   F(3, 4357)      =   1751.10
       Model |    11767.45         3  3922.48332   Prob > F        =    0.0000
    Residual |  9759.72638     4,357  2.24001064   R-squared       =    0.5466
-------------+----------------------------------   Adj R-squared   =    0.5463
       Total |  21527.1763     4,360  4.93742577   Root MSE        =    1.4967

------------------------------------------------------------------------------
    children |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     educhat |   -.171499   .0533921    -3.21   0.001    -.2761746   -.0668233
         age |   .3236052    .017931    18.05   0.000     .2884514     .358759
       agesq |  -.0026723   .0002808    -9.52   0.000    -.0032228   -.0021218
       _cons |  -3.387805   .5503399    -6.16   0.000    -4.466751   -2.308858
------------------------------------------------------------------------------

. reg children educ age agesq electric radio tv bicycle

      Source |       SS           df       MS      Number of obs   =     4,355
-------------+----------------------------------   F(7, 4347)      =    843.49
       Model |  12382.1193         7  1768.87419   Prob > F        =    0.0000
    Residual |  9116.01475     4,347  2.09708184   R-squared       =    0.5760
-------------+----------------------------------   Adj R-squared   =    0.5753
       Total |  21498.1341     4,354  4.93755951   Root MSE        =    1.4481

------------------------------------------------------------------------------
    children |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0769905   .0065118   -11.82   0.000     -.089757   -.0642241
         age |   .3401022   .0164553    20.67   0.000     .3078414    .3723629
       agesq |  -.0027066   .0002707   -10.00   0.000    -.0032374   -.0021758
    electric |  -.3027372   .0762049    -3.97   0.000    -.4521376   -.1533368
       radio |   .0100826   .0508572     0.20   0.843    -.0896234    .1097887
          tv |  -.2544847   .0917024    -2.78   0.006    -.4342682   -.0747012
     bicycle |   .3161949   .0501773     6.30   0.000     .2178219     .414568
       _cons |  -4.393026   .2410834   -18.22   0.000    -4.865672   -3.920379
------------------------------------------------------------------------------

. ivreg children age agesq electric radio tv bicycle (educ= frsthalf)

Instrumental variables (2SLS) regression

      Source |       SS           df       MS      Number of obs   =     4,355
-------------+----------------------------------   F(7, 4347)      =    786.29
       Model |  11940.2653         7  1705.75218   Prob > F        =    0.0000
    Residual |  9557.86883     4,347  2.19872759   R-squared       =    0.5554
-------------+----------------------------------   Adj R-squared   =    0.5547
       Total |  21498.1341     4,354  4.93755951   Root MSE        =    1.4828

------------------------------------------------------------------------------
    children |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.1715124    .070946    -2.42   0.016    -.3106027   -.0324222
         age |   .3263289   .0197441    16.53   0.000     .2876204    .3650374
       agesq |  -.0027019   .0002772    -9.75   0.000    -.0032455   -.0021584
    electric |  -.1002708   .1702308    -0.59   0.556    -.4340099    .2334684
       radio |   .1715746   .1314323     1.31   0.192    -.0860996    .4292489
          tv |  -.0172654   .2005971    -0.09   0.931    -.4105379    .3760071
     bicycle |   .3026615   .0523647     5.78   0.000     .1999999    .4053231
       _cons |  -3.625946   .6241004    -5.81   0.000    -4.849501   -2.402391
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   age agesq electric radio tv bicycle frsthalf
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/ulaseraslan/Desktop/ulaseraslan_25058_ps5.log
  log type:  text
 closed on:  10 Jan 2021, 18:04:05
------------------------------------------------------------------------------------------
