---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ulaseraslan/Desktop/ulaseraslan_econ1_ps2.log
  log type:  text
 opened on:  13 Nov 2020, 21:54:17

. reg psoda prpblck income

      Source |       SS           df       MS      Number of obs   =       401
-------------+----------------------------------   F(2, 398)       =     13.66
       Model |  .202552215         2  .101276107   Prob > F        =    0.0000
    Residual |  2.95146493       398  .007415741   R-squared       =    0.0642
-------------+----------------------------------   Adj R-squared   =    0.0595
       Total |  3.15401715       400  .007885043   Root MSE        =    .08611

------------------------------------------------------------------------------
       psoda |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     prpblck |   .1149882   .0260006     4.42   0.000     .0638724    .1661039
      income |   1.60e-06   3.62e-07     4.43   0.000     8.91e-07    2.31e-06
       _cons |   .9563196    .018992    50.35   0.000     .9189824    .9936568
------------------------------------------------------------------------------

. .1149882 - 0.1
1149882 - 0.1: class type not found
r(4018);

. 0.1149882- 0.1 
0.1149882 is not a valid command name
r(199);

. a = 0.1149882 - 0.1
command a is unrecognized
r(199);

. reg psoda prpblck

      Source |       SS           df       MS      Number of obs   =       401
-------------+----------------------------------   F(1, 399)       =      7.34
       Model |  .057010466         1  .057010466   Prob > F        =    0.0070
    Residual |  3.09700668       399  .007761922   R-squared       =    0.0181
-------------+----------------------------------   Adj R-squared   =    0.0156
       Total |  3.15401715       400  .007885043   Root MSE        =     .0881

------------------------------------------------------------------------------
       psoda |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     prpblck |   .0649269    .023957     2.71   0.007     .0178292    .1120245
       _cons |   1.037399   .0051905   199.87   0.000     1.027195    1.047603
------------------------------------------------------------------------------

. reg lpsoda prpblck lincome

      Source |       SS           df       MS      Number of obs   =       401
-------------+----------------------------------   F(2, 398)       =     14.54
       Model |  .196020672         2  .098010336   Prob > F        =    0.0000
    Residual |  2.68272938       398  .006740526   R-squared       =    0.0681
-------------+----------------------------------   Adj R-squared   =    0.0634
       Total |  2.87875005       400  .007196875   Root MSE        =     .0821

------------------------------------------------------------------------------
      lpsoda |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     prpblck |   .1215803   .0257457     4.72   0.000     .0709657    .1721948
     lincome |   .0765114   .0165969     4.61   0.000     .0438829    .1091399
       _cons |   -.793768   .1794337    -4.42   0.000    -1.146524   -.4410117
------------------------------------------------------------------------------

. reg psoda prpblck income prppov

      Source |       SS           df       MS      Number of obs   =       401
-------------+----------------------------------   F(3, 397)       =      9.76
       Model |   .21672761         3  .072242537   Prob > F        =    0.0000
    Residual |  2.93728954       397  .007398714   R-squared       =    0.0687
-------------+----------------------------------   Adj R-squared   =    0.0617
       Total |  3.15401715       400  .007885043   Root MSE        =    .08602

------------------------------------------------------------------------------
       psoda |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     prpblck |   .0888819   .0320968     2.77   0.006     .0257811    .1519828
      income |   2.03e-06   4.76e-07     4.27   0.000     1.10e-06    2.97e-06
      prppov |    .157464   .1137606     1.38   0.167    -.0661844    .3811124
       _cons |   .9278289   .0279918    33.15   0.000     .8727983    .9828595
------------------------------------------------------------------------------

. use "/Users/ulaseraslan/Desktop/VOTE1.DTA"

. reg voteA lexpendA lexpendB prtystrA

      Source |       SS           df       MS      Number of obs   =       173
-------------+----------------------------------   F(3, 169)       =    215.23
       Model |  38405.1096         3  12801.7032   Prob > F        =    0.0000
    Residual |  10052.1389       169   59.480112   R-squared       =    0.7926
-------------+----------------------------------   Adj R-squared   =    0.7889
       Total |  48457.2486       172  281.728189   Root MSE        =    7.7123

------------------------------------------------------------------------------
       voteA |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lexpendA |   6.083316     .38215    15.92   0.000     5.328914    6.837719
    lexpendB |  -6.615417   .3788203   -17.46   0.000    -7.363246   -5.867588
    prtystrA |   .1519574   .0620181     2.45   0.015     .0295274    .2743873
       _cons |   45.07893   3.926305    11.48   0.000     37.32801    52.82985
------------------------------------------------------------------------------

