-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ulaseraslan/Desktop/ulaseraslan_ps3.log
  log type:  text
 opened on:   3 Dec 2020, 21:05:40

. use "/Users/ulaseraslan/Desktop/SMOKE.DTA"

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        educ |        807    12.47088    3.057161          6         18
     cigpric |        807    60.30041    4.738469     44.004     70.129
       white |        807    .8785626    .3268375          0          1
         age |        807    41.23792    17.02729         17         88
      income |        807    19304.83    9142.958        500      30000
-------------+---------------------------------------------------------
        cigs |        807    8.686493    13.72152          0         80
    restaurn |        807    .2465923    .4312946          0          1
     lincome |        807    9.687316    .7126958   6.214608   10.30895
       agesq |        807    1990.135    1577.166        289       7744
    lcigpric |        807    4.096032    .0829194   3.784281   4.250336

. gen smoker:nonsmoker=0 if cigs=0 
invalid syntax
r(198);

. gen smoker=1

. replace smoker=0 if cigs<1
(497 real changes made)

. sum smoker

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      smoker |        807    .3841388    .4866926          0          1

. sum restaurn

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    restaurn |        807    .2465923    .4312946          0          1

. reg smoker restaurn

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(1, 805)       =      6.76
       Model |  1.59079787         1  1.59079787   Prob > F        =    0.0095
    Residual |  189.326179       805  .235187799   R-squared       =    0.0083
-------------+----------------------------------   Adj R-squared   =    0.0071
       Total |  190.916976       806  .236869698   Root MSE        =    .48496

------------------------------------------------------------------------------
      smoker |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    restaurn |  -.1030068   .0396064    -2.60   0.009    -.1807509   -.0252627
       _cons |   .4095395   .0196678    20.82   0.000     .3709333    .4481457
------------------------------------------------------------------------------

. ttest smoker by(restaurn)
factor-variable and time-series operators not allowed
r(101);

. ttest smoker, by(restaurn)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     608    .4095395    .0199595    .4921537    .3703415    .4487375
       1 |     199    .3065327    .0327657    .4622164    .2419182    .3711471
---------+--------------------------------------------------------------------
combined |     807    .3841388    .0171324    .4866926    .3505094    .4177682
---------+--------------------------------------------------------------------
    diff |            .1030068    .0396064                .0252627    .1807509
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   2.6008
Ho: diff = 0                                     degrees of freedom =      805

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9953         Pr(|T| > |t|) = 0.0095          Pr(T > t) = 0.0047

. reg smoker educ cigpric white age income cigs restaurn 

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(7, 799)       =    219.47
       Model |  125.596658         7  17.9423797   Prob > F        =    0.0000
    Residual |  65.3203186       799  .081752589   R-squared       =    0.6579
-------------+----------------------------------   Adj R-squared   =    0.6549
       Total |  190.916976       806  .236869698   Root MSE        =    .28592

------------------------------------------------------------------------------
      smoker |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0145477   .0035586    -4.09   0.000     -.021533   -.0075624
     cigpric |  -.0010105   .0021517    -0.47   0.639    -.0052342    .0032132
       white |  -.0093495   .0310337    -0.30   0.763    -.0702667    .0515676
         age |  -.0023992   .0006033    -3.98   0.000    -.0035833    -.001215
      income |  -1.01e-06   1.18e-06    -0.86   0.390    -3.33e-06    1.30e-06
        cigs |   .0281478   .0007411    37.98   0.000     .0266931    .0296025
    restaurn |   -.019343   .0239364    -0.81   0.419    -.0663288    .0276427
       _cons |   .5134688   .1420563     3.61   0.000     .2346212    .7923164
------------------------------------------------------------------------------

. reg smoker educ lcigpric white age lincome cigs restaurn agesq

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(8, 798)       =    191.73
       Model |   125.58171         8  15.6977138   Prob > F        =    0.0000
    Residual |   65.335266       798  .081873767   R-squared       =    0.6578
-------------+----------------------------------   Adj R-squared   =    0.6544
       Total |  190.916976       806  .236869698   Root MSE        =    .28614

------------------------------------------------------------------------------
      smoker |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0147648   .0035865    -4.12   0.000    -.0218049   -.0077248
    lcigpric |  -.0449876   .1233641    -0.36   0.715    -.2871442    .1971689
       white |  -.0099476   .0311396    -0.32   0.749    -.0710728    .0511777
         age |  -.0019726    .003474    -0.57   0.570    -.0087919    .0048468
     lincome |  -.0122852   .0155616    -0.79   0.430    -.0428316    .0182613
        cigs |   .0281321   .0007548    37.27   0.000     .0266506    .0296137
    restaurn |  -.0201457   .0239371    -0.84   0.400    -.0671328    .0268415
       agesq |  -4.67e-06   .0000379    -0.12   0.902    -.0000791    .0000698
       _cons |   .7315227   .5167391     1.42   0.157    -.2828057    1.745851
------------------------------------------------------------------------------

. reg smoker educ lcigpric white age lincome restaurn agesq

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(7, 799)       =      7.54
       Model |  11.8361161         7  1.69087372   Prob > F        =    0.0000
    Residual |   179.08086       799   .22413124   R-squared       =    0.0620
-------------+----------------------------------   Adj R-squared   =    0.0538
       Total |  190.916976       806  .236869698   Root MSE        =    .47343

------------------------------------------------------------------------------
      smoker |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0288802   .0059008    -4.89   0.000    -.0404632   -.0172973
    lcigpric |  -.0689254   .2041088    -0.34   0.736    -.4695782    .3317275
       white |  -.0256801   .0515172    -0.50   0.618    -.1268051    .0754449
         age |   .0198158    .005666     3.50   0.000     .0086938    .0309378
     lincome |    .012162   .0257245     0.47   0.636    -.0383335    .0626575
    restaurn |  -.1007616   .0394431    -2.55   0.011    -.1781859   -.0233374
       agesq |  -.0002598   .0000617    -4.21   0.000    -.0003809   -.0001387
       _cons |   .6560602    .854962     0.77   0.443    -1.022177    2.334297
------------------------------------------------------------------------------

. reg smoker educ cigpric white age income restaurn agesq

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(7, 799)       =      7.52
       Model |  11.7949955         7  1.68499936   Prob > F        =    0.0000
    Residual |  179.121981       799  .224182705   R-squared       =    0.0618
-------------+----------------------------------   Adj R-squared   =    0.0536
       Total |  190.916976       806  .236869698   Root MSE        =    .47348

------------------------------------------------------------------------------
      smoker |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   -.028552   .0059364    -4.81   0.000    -.0402049   -.0168992
     cigpric |   -.001053   .0035634    -0.30   0.768    -.0080477    .0059417
       white |  -.0263784   .0514915    -0.51   0.609     -.127453    .0746962
         age |   .0202079   .0056356     3.59   0.000     .0091456    .0312703
      income |   4.64e-07   2.01e-06     0.23   0.818    -3.48e-06    4.41e-06
    restaurn |  -.1006295   .0394733    -2.55   0.011    -.1781131   -.0231459
       agesq |   -.000264   .0000614    -4.30   0.000    -.0003846   -.0001435
       _cons |   .5348554    .248302     2.15   0.032     .0474541    1.022257
------------------------------------------------------------------------------

. reg smoker educ cigpric white age income restaurn

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(6, 800)       =      5.57
       Model |  7.65188433         6  1.27531406   Prob > F        =    0.0000
    Residual |  183.265092       800  .229081365   R-squared       =    0.0401
-------------+----------------------------------   Adj R-squared   =    0.0329
       Total |  190.916976       806  .236869698   Root MSE        =    .47862

------------------------------------------------------------------------------
      smoker |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0249073   .0059394    -4.19   0.000     -.036566   -.0132486
     cigpric |  -.0008891   .0036019    -0.25   0.805    -.0079595    .0061812
       white |  -.0125129   .0519488    -0.24   0.810     -.114485    .0894592
         age |  -.0036367   .0010083    -3.61   0.000     -.005616   -.0016574
      income |   2.66e-06   1.97e-06     1.35   0.176    -1.20e-06    6.52e-06
    restaurn |  -.1035212   .0398964    -2.59   0.010    -.1818353   -.0252071
       _cons |   .8834777   .2372363     3.72   0.000     .4177986    1.349157
------------------------------------------------------------------------------

. reg smoker educ cigpric white age income restaurn agesq

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(7, 799)       =      7.52
       Model |  11.7949955         7  1.68499936   Prob > F        =    0.0000
    Residual |  179.121981       799  .224182705   R-squared       =    0.0618
-------------+----------------------------------   Adj R-squared   =    0.0536
       Total |  190.916976       806  .236869698   Root MSE        =    .47348

------------------------------------------------------------------------------
      smoker |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   -.028552   .0059364    -4.81   0.000    -.0402049   -.0168992
     cigpric |   -.001053   .0035634    -0.30   0.768    -.0080477    .0059417
       white |  -.0263784   .0514915    -0.51   0.609     -.127453    .0746962
         age |   .0202079   .0056356     3.59   0.000     .0091456    .0312703
      income |   4.64e-07   2.01e-06     0.23   0.818    -3.48e-06    4.41e-06
    restaurn |  -.1006295   .0394733    -2.55   0.011    -.1781131   -.0231459
       agesq |   -.000264   .0000614    -4.30   0.000    -.0003846   -.0001435
       _cons |   .5348554    .248302     2.15   0.032     .0474541    1.022257
------------------------------------------------------------------------------

. graph matrix smoker educ cigpric white age income restaurn agesq

. graph matrix smoker educ cigpric white age income restaurn agesq

. graph smoker agesq
smokergraph_g.new agesq: class member function not found
r(4023);

. plot smoker aqesq
variable aqesq not found
r(111);

. plot smoker agesq

       1 +  
         | *********************************** *****       **         *
         |  
         |  
         |  
         |  
         |  
    s    |  
    m    |  
    o    |  
    k    |  
    e    |  
    r    |  
         |  
         |  
         |  
         |  
         |  
         |  
         |  
       0 + *********************************** ***** **** *** **  *     ***
          +----------------------------------------------------------------+
              289                      age^2                          7744


. plot smoke age

       1 +  
         | *************************************************     *      *
         |  
         |  
         |  
         |  
         |  
    s    |  
    m    |  
    o    |  
    k    |  
    e    |  
    r    |  
         |  
         |  
         |  
         |  
         |  
         |  
         |  
       0 + ********************************************************* *   ***
          +----------------------------------------------------------------+
               17                    in years                          88


. graph matrix smoker educ cigpric white age income restaurn agesq

. graph matrix smoker educ cigpric white age income restaurn 

. reg smoker educ lcigpric white age lincome restaurn agesq 

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(7, 799)       =      7.54
       Model |  11.8361161         7  1.69087372   Prob > F        =    0.0000
    Residual |   179.08086       799   .22413124   R-squared       =    0.0620
-------------+----------------------------------   Adj R-squared   =    0.0538
       Total |  190.916976       806  .236869698   Root MSE        =    .47343

------------------------------------------------------------------------------
      smoker |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0288802   .0059008    -4.89   0.000    -.0404632   -.0172973
    lcigpric |  -.0689254   .2041088    -0.34   0.736    -.4695782    .3317275
       white |  -.0256801   .0515172    -0.50   0.618    -.1268051    .0754449
         age |   .0198158    .005666     3.50   0.000     .0086938    .0309378
     lincome |    .012162   .0257245     0.47   0.636    -.0383335    .0626575
    restaurn |  -.1007616   .0394431    -2.55   0.011    -.1781859   -.0233374
       agesq |  -.0002598   .0000617    -4.21   0.000    -.0003809   -.0001387
       _cons |   .6560602    .854962     0.77   0.443    -1.022177    2.334297
------------------------------------------------------------------------------

. gen white_restrict = white*restaurn

. reg smoker educ white age restaurn agesq white_restrict

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(6, 800)       =      8.93
       Model |   11.977995         6   1.9963325   Prob > F        =    0.0000
    Residual |  178.938981       800  .223673727   R-squared       =    0.0627
-------------+----------------------------------   Adj R-squared   =    0.0557
       Total |  190.916976       806  .236869698   Root MSE        =    .47294

--------------------------------------------------------------------------------
        smoker |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
          educ |   -.028523   .0057087    -5.00   0.000    -.0397287   -.0173172
         white |  -.0626063    .063624    -0.98   0.325    -.1874961    .0622834
           age |   .0208004   .0054581     3.81   0.000     .0100866    .0315142
      restaurn |  -.1906341   .0992685    -1.92   0.055    -.3854916    .0042234
         agesq |  -.0002706   .0000594    -4.55   0.000    -.0003873    -.000154
white_restrict |    .105592    .108003     0.98   0.329    -.1064108    .3175948
         _cons |   .5013577   .1344813     3.73   0.000     .2373799    .7653355
--------------------------------------------------------------------------------

. clear

. use "/Users/ulaseraslan/Desktop/JTRAIN.DTA"

. browse

. use if year = 1988
=exp not allowed
r(101);

. reg lscrap grant if year = 1988
invalid syntax
r(198);

. drop if year !=1988
(314 observations deleted)

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |        157        1988           0       1988       1988
       fcode |        157    415708.9    4031.509     410032     419486
      employ |        146    58.89041    72.82157          5        500
       sales |        126     5997978     7272416     110000   4.30e+07
      avgsal |        136    18776.59    6540.995       7484      38000
-------------+---------------------------------------------------------
       scrap |         54    3.787778    5.984144        .05         25
      rework |         41    3.436098    5.064462          0         27
      tothrs |        136    29.38235    45.44024          0        290
       union |        157    .1974522    .3993503          0          1
       grant |        157    .2292994    .4217274          0          1
-------------+---------------------------------------------------------
         d89 |        157           0           0          0          0
         d88 |        157           1           0          1          1
     totrain |        155     22.4129    40.26032          0        290
      hrsemp |        127    16.09254    26.51432          0   163.9167
      lscrap |         54    .4284409    1.409956  -2.995732   3.218876
-------------+---------------------------------------------------------
     lemploy |        146    3.537871    1.023852   1.609438   6.214608
      lsales |        126    15.03148    1.100873   11.60824   17.57671
     lrework |         40    .1985876    1.761193   -4.60517   3.295837
     lhrsemp |        127    1.747284    1.553904          0    5.10544
    lscrap_1 |         54    .5974341    1.594659   -4.60517   3.401197
-------------+---------------------------------------------------------
     grant_1 |        157           0           0          0          0
     clscrap |         54   -.1689931    .5897736   -2.50217   2.397895
      cgrant |        157    .2292994    .4217274          0          1
    clemploy |        144    .0968757    .2511801   -.411099   1.673976
     clsales |        119    .1289949    .4894217  -1.982874   2.896701
-------------+---------------------------------------------------------
     lavgsal |        136    9.782046    .3436358   8.920523   10.54534
    clavgsal |        131    .0586008    .0742551   -.080411   .5689116
    cgrant_1 |        157           0           0          0          0
     chrsemp |        125     7.42305    19.30129  -47.75349   107.0278
    clhrsemp |        125      .64258    1.235229  -2.338574   4.394449

. reg lscrap grant

      Source |       SS           df       MS      Number of obs   =        54
-------------+----------------------------------   F(1, 52)        =      0.02
       Model |  .039451758         1  .039451758   Prob > F        =    0.8895
    Residual |  105.323208        52  2.02544631   R-squared       =    0.0004
-------------+----------------------------------   Adj R-squared   =   -0.0188
       Total |   105.36266        53  1.98797472   Root MSE        =    1.4232

------------------------------------------------------------------------------
      lscrap |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       grant |   .0566004   .4055519     0.14   0.890     -.757199    .8703998
       _cons |    .408526   .2405616     1.70   0.095    -.0741962    .8912482
------------------------------------------------------------------------------

. reg lscrap grant lscrap_1

      Source |       SS           df       MS      Number of obs   =        54
-------------+----------------------------------   F(2, 51)        =    174.94
       Model |  91.9584791         2  45.9792396   Prob > F        =    0.0000
    Residual |  13.4041809        51  .262827077   R-squared       =    0.8728
-------------+----------------------------------   Adj R-squared   =    0.8678
       Total |   105.36266        53  1.98797472   Root MSE        =    .51267

------------------------------------------------------------------------------
      lscrap |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       grant |  -.2539697   .1470311    -1.73   0.090    -.5491469    .0412076
    lscrap_1 |   .8311606   .0444444    18.70   0.000     .7419347    .9203865
       _cons |    .021237   .0890967     0.24   0.813    -.1576321    .2001061
------------------------------------------------------------------------------

. clear

. exit
