------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ulaseraslan/Desktop/ulaseraslan_25058_ps4.log
  log type:  text
 opened on:  26 Dec 2020, 00:38:16

. use "/Users/ulaseraslan/Desktop/card_krueger_data.dta"

. g fte_wave1 = empft + (emppt/2) + nmgrs
(12 missing values generated)

. g fte_wave2 = empft2 + (emppt2/2) + nmgrs2
(14 missing values generated)

. table state, c(m fte_wave1 m fte_wave2)

---------------------------------------------
 dummy state | mean(fte_wa~1)  mean(fte_wa~2)
-------------+-------------------------------
Pennsylvania |       23.33117        21.16558
  New Jersey |       20.43941        21.02743
---------------------------------------------

. ttest fte_wave1 , by(state)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pennsylv |      77    23.33117    1.351149    11.85628    20.64012    26.02222
New Jers |     321    20.43941    .5082607    9.106239    19.43945    21.43936
---------+--------------------------------------------------------------------
combined |     398    20.99887    .4887136    9.749805    20.03808    21.95966
---------+--------------------------------------------------------------------
    diff |            2.891761    1.230207                .4732069    5.310315
------------------------------------------------------------------------------
    diff = mean(Pennsylv) - mean(New Jers)                        t =   2.3506
Ho: diff = 0                                     degrees of freedom =      396

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9904         Pr(|T| > |t|) = 0.0192          Pr(T > t) = 0.0096

. ttest fte_wave2 , by(state)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pennsylv |      77    21.16558    .9432212    8.276732      19.287    23.04417
New Jers |     319    21.02743    .5203094    9.293024    20.00375    22.05111
---------+--------------------------------------------------------------------
combined |     396    21.05429    .4570134    9.094453    20.15581    21.95278
---------+--------------------------------------------------------------------
    diff |            .1381549    1.156182               -2.134902    2.411212
------------------------------------------------------------------------------
    diff = mean(Pennsylv) - mean(New Jers)                        t =   0.1195
Ho: diff = 0                                     degrees of freedom =      394

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5475         Pr(|T| > |t|) = 0.9049          Pr(T > t) = 0.4525

. g dif_fte =fte_wave2-fte_wave1
(26 missing values generated)

. ttest dif_fte, by(state)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pennsylv |      75   -2.283333    1.253269    10.85363   -4.780526    .2138597
New Jers |     309    .4666667    .4808286    8.452195   -.4794578    1.412791
---------+--------------------------------------------------------------------
combined |     384   -.0704427    .4604186    9.022325   -.9757072    .8348218
---------+--------------------------------------------------------------------
    diff |               -2.75    1.154355               -5.019686    -.480314
------------------------------------------------------------------------------
    diff = mean(Pennsylv) - mean(New Jers)                        t =  -2.3823
Ho: diff = 0                                     degrees of freedom =      382

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0088         Pr(|T| > |t|) = 0.0177          Pr(T > t) = 0.9912

. reg dif_fte state

      Source |       SS           df       MS      Number of obs   =       384
-------------+----------------------------------   F(1, 382)       =      5.68
       Model |  456.408692         1  456.408692   Prob > F        =    0.0177
    Residual |  30720.6883       382  80.4206501   R-squared       =    0.0146
-------------+----------------------------------   Adj R-squared   =    0.0121
       Total |   31177.097       383  81.4023421   Root MSE        =    8.9678

------------------------------------------------------------------------------
     dif_fte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       state |       2.75   1.154355     2.38   0.018      .480314    5.019686
       _cons |  -2.283333   1.035507    -2.21   0.028    -4.319341   -.2473256
------------------------------------------------------------------------------

. drop if wage_st==.
(20 observations deleted)

. drop if wage_st2 ==.
(20 observations deleted)

. reg dif_fte state

      Source |       SS           df       MS      Number of obs   =       351
-------------+----------------------------------   F(1, 349)       =      3.66
       Model |  277.813658         1  277.813658   Prob > F        =    0.0566
    Residual |  26504.4967       349  75.9441167   R-squared       =    0.0104
-------------+----------------------------------   Adj R-squared   =    0.0075
       Total |  26782.3104       350  76.5208869   Root MSE        =    8.7146

------------------------------------------------------------------------------
     dif_fte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       state |   2.276858   1.190436     1.91   0.057     -.064474     4.61819
       _cons |  -1.878788   1.072692    -1.75   0.081    -3.988542    .2309665
------------------------------------------------------------------------------

. reg dif_fte state i.chain co_owned

      Source |       SS           df       MS      Number of obs   =       351
-------------+----------------------------------   F(5, 345)       =      1.44
       Model |  545.889366         5  109.177873   Prob > F        =    0.2108
    Residual |   26236.421       345  76.0475972   R-squared       =    0.0204
-------------+----------------------------------   Adj R-squared   =    0.0062
       Total |  26782.3104       350  76.5208869   Root MSE        =    8.7205

-----------------------------------------------------------------------------------------
                dif_fte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  state |   2.281507   1.197044     1.91   0.057    -.0729144    4.635929
                        |
                  chain |
kentucky fried chicken  |   .2345508    1.29674     0.18   0.857     -2.31596    2.785061
                  roys  |  -2.084687   1.321259    -1.58   0.116    -4.683423    .5140495
                wendys  |  -.7566441   1.491088    -0.51   0.612     -3.68941    2.176122
                        |
               co_owned |   .3729144   1.098762     0.34   0.735    -1.788201     2.53403
                  _cons |  -1.450031     1.2099    -1.20   0.232     -3.82974     .929677
-----------------------------------------------------------------------------------------

. g full_meal1 = psoda + pfry + pentree 
(20 missing values generated)

. g full_meal2 = psoda2 + pfry2 + pentree2
(18 missing values generated)

. g log_fullmeal1 = log(full_meal1)
(20 missing values generated)

. g log_fullmeal2 = log(full_meal2)
(18 missing values generated)

. g log_fullmeal_dif = log_fullmeal2 - log_fullmeal1
(36 missing values generated)

. drop if  dif_fte ==.
(19 observations deleted)

. reg log_fullmeal_dif state

      Source |       SS           df       MS      Number of obs   =       317
-------------+----------------------------------   F(1, 315)       =      5.09
       Model |  .052112289         1  .052112289   Prob > F        =    0.0247
    Residual |  3.22203683       315  .010228688   R-squared       =    0.0159
-------------+----------------------------------   Adj R-squared   =    0.0128
       Total |  3.27414912       316  .010361231   Root MSE        =    .10114

------------------------------------------------------------------------------
log_fullme~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       state |   .0325248   .0144097     2.26   0.025     .0041734    .0608762
       _cons |  -.0090863   .0129493    -0.70   0.483    -.0345643    .0163917
------------------------------------------------------------------------------

. reg log_fullmeal_dif state i.chain co_owned

      Source |       SS           df       MS      Number of obs   =       317
-------------+----------------------------------   F(5, 311)       =      6.83
       Model |  .323862508         5  .064772502   Prob > F        =    0.0000
    Residual |  2.95028661       311  .009486452   R-squared       =    0.0989
-------------+----------------------------------   Adj R-squared   =    0.0844
       Total |  3.27414912       316  .010361231   Root MSE        =     .0974

-----------------------------------------------------------------------------------------
       log_fullmeal_dif |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  state |   .0367495   .0139566     2.63   0.009     .0092882    .0642107
                        |
                  chain |
kentucky fried chicken  |   -.007042   .0149151    -0.47   0.637    -.0363893    .0223053
                  roys  |  -.0004594   .0158925    -0.03   0.977    -.0317298    .0308111
                wendys  |   .0851266   .0174853     4.87   0.000     .0507222     .119531
                        |
               co_owned |   .0005565   .0130868     0.04   0.966    -.0251934    .0263065
                  _cons |   -.021993   .0142773    -1.54   0.124    -.0500854    .0060994
-----------------------------------------------------------------------------------------

. clear

. use "/Users/ulaseraslan/Desktop/TRAFFIC2.DTA"

. reg prcfat t feb mar apr may jun jul aug sep oct nov dec wkends unem spdlaw beltlaw

      Source |       SS           df       MS      Number of obs   =       108
-------------+----------------------------------   F(16, 91)       =     14.44
       Model |  .764228387        16  .047764274   Prob > F        =    0.0000
    Residual |  .301019769        91   .00330791   R-squared       =    0.7174
-------------+----------------------------------   Adj R-squared   =    0.6677
       Total |  1.06524816       107   .00995559   Root MSE        =    .05751

------------------------------------------------------------------------------
      prcfat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0022352   .0004208    -5.31   0.000    -.0030711   -.0013993
         feb |   .0008607   .0289967     0.03   0.976    -.0567377    .0584592
         mar |   .0000923   .0274069     0.00   0.997    -.0543481    .0545327
         apr |   .0582201   .0278195     2.09   0.039     .0029601      .11348
         may |   .0716392   .0276432     2.59   0.011     .0167293    .1265492
         jun |   .1012618   .0280937     3.60   0.001     .0454571    .1570665
         jul |   .1766121   .0272592     6.48   0.000      .122465    .2307592
         aug |   .1926117   .0274448     7.02   0.000     .1380959    .2471274
         sep |   .1600164    .028203     5.67   0.000     .1039947    .2160381
         oct |   .1010357   .0276702     3.65   0.000     .0460722    .1559991
         nov |    .013949   .0281436     0.50   0.621    -.0419548    .0698528
         dec |   .0092005    .027858     0.33   0.742     -.046136     .064537
      wkends |   .0006259   .0061624     0.10   0.919     -.011615    .0128668
        unem |  -.0154259   .0055444    -2.78   0.007    -.0264392   -.0044127
      spdlaw |   .0670877   .0205683     3.26   0.002     .0262312    .1079441
     beltlaw |  -.0295053   .0232307    -1.27   0.207    -.0756503    .0166397
       _cons |   1.029799   .1029523    10.00   0.000     .8252964    1.234301
------------------------------------------------------------------------------

. clear

. use "/Users/ulaseraslan/Desktop/INJURY.DTA"

. reg ldurat afchnge highearn afhigh if ky ==1

      Source |       SS           df       MS      Number of obs   =     5,626
-------------+----------------------------------   F(3, 5622)      =     39.54
       Model |  191.071442         3  63.6904807   Prob > F        =    0.0000
    Residual |   9055.9345     5,622  1.61080301   R-squared       =    0.0207
-------------+----------------------------------   Adj R-squared   =    0.0201
       Total |  9247.00594     5,625  1.64391217   Root MSE        =    1.2692

------------------------------------------------------------------------------
      ldurat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     afchnge |   .0076573   .0447173     0.17   0.864    -.0800058    .0953204
    highearn |   .2564785   .0474464     5.41   0.000     .1634652    .3494918
      afhigh |   .1906012   .0685089     2.78   0.005     .0562973    .3249051
       _cons |   1.125615   .0307368    36.62   0.000     1.065359    1.185871
------------------------------------------------------------------------------

. reg ldurat afchnge highearn afhigh male married i.indust i.injtype if ky ==1

      Source |       SS           df       MS      Number of obs   =     5,349
-------------+----------------------------------   F(14, 5334)     =     16.37
       Model |  358.441793        14  25.6029852   Prob > F        =    0.0000
    Residual |  8341.41206     5,334  1.56381928   R-squared       =    0.0412
-------------+----------------------------------   Adj R-squared   =    0.0387
       Total |  8699.85385     5,348  1.62674904   Root MSE        =    1.2505

------------------------------------------------------------------------------
      ldurat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     afchnge |   .0106274   .0449167     0.24   0.813    -.0774276    .0986824
    highearn |   .1757598   .0517462     3.40   0.001     .0743161    .2772035
      afhigh |   .2308768   .0695248     3.32   0.001     .0945798    .3671738
        male |  -.0979407   .0445498    -2.20   0.028    -.1852766   -.0106049
     married |   .1220995   .0391228     3.12   0.002     .0454027    .1987962
             |
      indust |
          2  |   .2708676    .058666     4.62   0.000     .1558581     .385877
          3  |   .1606709   .0409038     3.93   0.000     .0804827    .2408591
             |
     injtype |
          2  |   .7838129    .156167     5.02   0.000     .4776617    1.089964
          3  |   .3353613   .0923382     3.63   0.000     .1543407     .516382
          4  |   .6403517   .1008698     6.35   0.000     .4426058    .8380977
          5  |   .5053036   .0928059     5.44   0.000     .3233661    .6872411
          6  |   .3936092   .0935647     4.21   0.000     .2101841    .5770344
          7  |   .7866121    .207028     3.80   0.000     .3807527    1.192472
          8  |   .5139003   .1292776     3.98   0.000     .2604634    .7673372
             |
       _cons |   .5713505     .10266     5.57   0.000     .3700949    .7726061
------------------------------------------------------------------------------

. reg ldurat afchnge highearn afhigh male married i.indust i.injtype if mi==1

      Source |       SS           df       MS      Number of obs   =     1,475
-------------+----------------------------------   F(14, 1460)     =      6.23
       Model |  157.402557        14  11.2430398   Prob > F        =    0.0000
    Residual |  2634.85251     1,460   1.8046935   R-squared       =    0.0564
-------------+----------------------------------   Adj R-squared   =    0.0473
       Total |  2792.25507     1,474  1.89433858   Root MSE        =    1.3434

------------------------------------------------------------------------------
      ldurat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     afchnge |   .0945221   .0845739     1.12   0.264    -.0713771    .2604214
    highearn |   .1283726   .1106405     1.16   0.246    -.0886587     .345404
      afhigh |   .1426902   .1535674     0.93   0.353     -.158546    .4439265
        male |   -.352384   .0967692    -3.64   0.000    -.5422054   -.1625625
     married |   .0890124   .0772949     1.15   0.250    -.0626086    .2406334
             |
      indust |
          2  |   .5217602   .1043794     5.00   0.000     .3170106    .7265097
          3  |   .0840317   .0786529     1.07   0.286    -.0702531    .2383165
             |
     injtype |
          2  |   .5427369   .3578638     1.52   0.130    -.1592453    1.244719
          3  |   .5704354   .2152079     2.65   0.008     .1482856    .9925852
          4  |   .8621662   .2267469     3.80   0.000     .4173817    1.306951
          5  |   .3487954   .2172853     1.61   0.109    -.0774294    .7750202
          6  |   .4365839   .2186971     2.00   0.046     .0075898    .8655779
          7  |   1.224634   .3442126     3.56   0.000     .5494299    1.899838
          8  |   .7792353   .2719179     2.87   0.004     .2458439    1.312627
             |
       _cons |   1.006806   .2315093     4.35   0.000     .5526795    1.460932
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/ulaseraslan/Desktop/ulaseraslan_25058_ps4.log
  log type:  text
 closed on:  26 Dec 2020, 00:43:24
------------------------------------------------------------------------------------------
