------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ulaseraslan/Desktop/ulaseraslan_25058_final.log
  log type:  text
 opened on:  29 Jan 2021, 01:39:13

. use "/Users/ulaseraslan/Desktop/FISHEXAM.dta"

. g lprice = log(avgprc)

. g t2 = t^2

. tset t
        time variable:  t, 1 to 97
                delta:  1 unit

. 
. reg lprice t t2 mon tues wed thurs

      Source |       SS           df       MS      Number of obs   =        97
-------------+----------------------------------   F(6, 90)        =      2.23
       Model |  2.03081336         6  .338468893   Prob > F        =    0.0476
    Residual |  13.6822968        90   .15202552   R-squared       =    0.1292
-------------+----------------------------------   Adj R-squared   =    0.0712
       Total |  15.7131102        96  .163678231   Root MSE        =     .3899

------------------------------------------------------------------------------
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0157773   .0057205    -2.76   0.007    -.0271421   -.0044125
          t2 |   .0001202   .0000565     2.13   0.036     7.91e-06    .0002325
         mon |  -.0119865   .1269225    -0.09   0.925    -.2641403    .2401672
        tues |   .0009034   .1249963     0.01   0.994    -.2474236    .2492304
         wed |   .0379775   .1233313     0.31   0.759    -.2070417    .2829967
       thurs |   .0908549   .1233069     0.74   0.463    -.1541157    .3358255
       _cons |   .1199856   .1449338     0.83   0.410    -.1679507     .407922
------------------------------------------------------------------------------

. reg lprice t t2 mon tues wed thurs wave2 wave3

      Source |       SS           df       MS      Number of obs   =        97
-------------+----------------------------------   F(8, 88)        =      6.11
       Model |  5.60842892         8  .701053615   Prob > F        =    0.0000
    Residual |  10.1046813        88  .114825924   R-squared       =    0.3569
-------------+----------------------------------   Adj R-squared   =    0.2985
       Total |  15.7131102        96  .163678231   Root MSE        =    .33886

------------------------------------------------------------------------------
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0133972     .00499    -2.68   0.009    -.0233138   -.0034806
          t2 |   .0001253   .0000492     2.55   0.013     .0000276     .000223
         mon |  -.0194277   .1107063    -0.18   0.861    -.2394332    .2005777
        tues |   .0009585   .1088778     0.01   0.993    -.2154133    .2173303
         wed |   .0491159   .1084457     0.45   0.652    -.1663972    .2646289
       thurs |   .1223422   .1077042     1.14   0.259    -.0916971    .3363816
       wave2 |   .0905067   .0211126     4.29   0.000     .0485499    .1324635
       wave3 |   .0493256   .0202115     2.44   0.017     .0091596    .0894916
       _cons |  -.7287036   .1989664    -3.66   0.000    -1.124108   -.3332996
------------------------------------------------------------------------------

. g growthprice = (avgprc-l.avgprc)/l.avgprc
(1 missing value generated)

. reg growthprice t t2 mon tues wed thurs wave2 wave3

      Source |       SS           df       MS      Number of obs   =        96
-------------+----------------------------------   F(8, 87)        =      1.98
       Model |  1.59476471         8  .199345589   Prob > F        =    0.0589
    Residual |  8.77654349        87   .10087981   R-squared       =    0.1538
-------------+----------------------------------   Adj R-squared   =    0.0760
       Total |  10.3713082        95  .109171665   Root MSE        =    .31762

------------------------------------------------------------------------------
 growthprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0040458   .0048301    -0.84   0.405    -.0136462    .0055546
          t2 |   .0000558   .0000474     1.18   0.243    -.0000385    .0001501
         mon |   .1672186   .1055221     1.58   0.117    -.0425181    .3769552
        tues |   .1008136   .1020524     0.99   0.326    -.1020265    .3036537
         wed |   .2019699   .1016756     1.99   0.050    -.0001214    .4040613
       thurs |    .176946   .1009541     1.75   0.083    -.0237112    .3776032
       wave2 |   .0597081   .0197939     3.02   0.003     .0203655    .0990507
       wave3 |   .0063115   .0193373     0.33   0.745    -.0321235    .0447466
       _cons |  -.3873655    .186505    -2.08   0.041    -.7580643   -.0166667
------------------------------------------------------------------------------

. 
. g ltotqty = log(totqty) 

. reg ltotqty lprice mon tues wed thurs t t2

      Source |       SS           df       MS      Number of obs   =        97
-------------+----------------------------------   F(7, 89)        =      3.82
       Model |  12.9801993         7  1.85431419   Prob > F        =    0.0011
    Residual |  43.1522342        89  .484856564   R-squared       =    0.2312
-------------+----------------------------------   Adj R-squared   =    0.1708
       Total |  56.1324335        96  .584712849   Root MSE        =    .69632

------------------------------------------------------------------------------
     ltotqty |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      lprice |  -.5983342   .1882466    -3.18   0.002    -.9723762   -.2242922
         mon |  -.3200239   .2266776    -1.41   0.161    -.7704274    .1303796
        tues |  -.6740226   .2232265    -3.02   0.003    -1.117569   -.2304763
         wed |  -.5330649    .220369    -2.42   0.018    -.9709333   -.0951965
       thurs |   .0730521   .2208725     0.33   0.742    -.3658167     .511921
           t |  -.0136252    .010639    -1.28   0.204    -.0347647    .0075143
          t2 |   .0001242   .0001035     1.20   0.233    -.0000814    .0003298
       _cons |   8.496822   .2598158    32.70   0.000     7.980573     9.01307
------------------------------------------------------------------------------

. 
. reg lprice t t2 mon tues wed thurs wave2 wave3

      Source |       SS           df       MS      Number of obs   =        97
-------------+----------------------------------   F(8, 88)        =      6.11
       Model |  5.60842892         8  .701053615   Prob > F        =    0.0000
    Residual |  10.1046813        88  .114825924   R-squared       =    0.3569
-------------+----------------------------------   Adj R-squared   =    0.2985
       Total |  15.7131102        96  .163678231   Root MSE        =    .33886

------------------------------------------------------------------------------
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0133972     .00499    -2.68   0.009    -.0233138   -.0034806
          t2 |   .0001253   .0000492     2.55   0.013     .0000276     .000223
         mon |  -.0194277   .1107063    -0.18   0.861    -.2394332    .2005777
        tues |   .0009585   .1088778     0.01   0.993    -.2154133    .2173303
         wed |   .0491159   .1084457     0.45   0.652    -.1663972    .2646289
       thurs |   .1223422   .1077042     1.14   0.259    -.0916971    .3363816
       wave2 |   .0905067   .0211126     4.29   0.000     .0485499    .1324635
       wave3 |   .0493256   .0202115     2.44   0.017     .0091596    .0894916
       _cons |  -.7287036   .1989664    -3.66   0.000    -1.124108   -.3332996
------------------------------------------------------------------------------

. predict lpricehat
(option xb assumed; fitted values)

. reg ltotqty lpricehat mon tues wed thurs t t2

      Source |       SS           df       MS      Number of obs   =        97
-------------+----------------------------------   F(7, 89)        =      3.20
       Model |   11.290185         7  1.61288357   Prob > F        =    0.0045
    Residual |  44.8422485        89  .503845488   R-squared       =    0.2011
-------------+----------------------------------   Adj R-squared   =    0.1383
       Total |  56.1324335        96  .584712849   Root MSE        =    .70982

------------------------------------------------------------------------------
     ltotqty |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lpricehat |  -.9469797   .3752769    -2.52   0.013    -1.692647   -.2013124
         mon |  -.3242029   .2311061    -1.40   0.164    -.7834058    .1349999
        tues |  -.6737076   .2275559    -2.96   0.004    -1.125856   -.2215589
         wed |  -.5198242   .2249764    -2.31   0.023    -.9668476   -.0728009
       thurs |   .1047283   .2270546     0.46   0.646    -.3464244    .5558809
           t |  -.0191259   .0119796    -1.60   0.114    -.0429292    .0046774
          t2 |   .0001661   .0001124     1.48   0.143    -.0000571    .0003894
       _cons |   8.538654   .2676665    31.90   0.000     8.006806    9.070502
------------------------------------------------------------------------------

. 
. 
. ivreg ltotqty mon tues wed thurs t t2 (lprice= wave2 wave3)

Instrumental variables (2SLS) regression

      Source |       SS           df       MS      Number of obs   =        97
-------------+----------------------------------   F(7, 89)        =      3.20
       Model |  11.3170661         7  1.61672372   Prob > F        =    0.0045
    Residual |  44.8153674        89  .503543454   R-squared       =    0.2016
-------------+----------------------------------   Adj R-squared   =    0.1388
       Total |  56.1324335        96  .584712849   Root MSE        =    .70961

------------------------------------------------------------------------------
     ltotqty |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      lprice |  -.9469797   .3751644    -2.52   0.013    -1.692423    -.201536
         mon |  -.3242029   .2310368    -1.40   0.164    -.7832682    .1348623
        tues |  -.6737076   .2274877    -2.96   0.004    -1.125721   -.2216944
         wed |  -.5198242    .224909    -2.31   0.023    -.9667136   -.0729349
       thurs |   .1047283   .2269865     0.46   0.646    -.3462891    .5557457
           t |  -.0191259   .0119761    -1.60   0.114    -.0429221    .0046703
          t2 |   .0001661   .0001123     1.48   0.143    -.0000571    .0003893
       _cons |   8.538654   .2675862    31.91   0.000     8.006966    9.070342
------------------------------------------------------------------------------
Instrumented:  lprice
Instruments:   mon tues wed thurs t t2 wave2 wave3
------------------------------------------------------------------------------

. 
. scatter wave2 lprice

. g lwave2 = log(wave2)

. g lwave3 = log(wave3)

. scatter lprice wave2

. scatter lprice lwave2

. scatter lprice wave3

. scatter lprice lwave3

. ivreg ltotqty mon tues wed thurs t t2 (lprice= lwave2 lwave3)

Instrumental variables (2SLS) regression

      Source |       SS           df       MS      Number of obs   =        97
-------------+----------------------------------   F(7, 89)        =      3.37
       Model |  10.5005625         7  1.50008036   Prob > F        =    0.0031
    Residual |   45.631871        89  .512717651   R-squared       =    0.1871
-------------+----------------------------------   Adj R-squared   =    0.1231
       Total |  56.1324335        96  .584712849   Root MSE        =    .71604

------------------------------------------------------------------------------
     ltotqty |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      lprice |  -1.024045   .3663458    -2.80   0.006    -1.751966   -.2961235
         mon |  -.3251267   .2331292    -1.39   0.167    -.7883494     .138096
        tues |   -.673638   .2295506    -2.93   0.004     -1.12975   -.2175258
         wed |  -.5168975   .2269196    -2.28   0.025     -.967782    -.066013
       thurs |     .11173   .2288809     0.49   0.627    -.3430514    .5665114
           t |  -.0203418   .0119905    -1.70   0.093    -.0441667    .0034832
          t2 |   .0001754   .0001128     1.56   0.123    -.0000487    .0003995
       _cons |   8.547901     .26977    31.69   0.000     8.011873    9.083928
------------------------------------------------------------------------------
Instrumented:  lprice
Instruments:   mon tues wed thurs t t2 lwave2 lwave3
------------------------------------------------------------------------------

. scatter wave2 lprice

. drop if wave2>10
(1 observation deleted)

. drop if wave3>10
(2 observations deleted)

. 
. ivreg ltotqty mon tues wed thurs t t2 (lprice= wave2 wave3)

Instrumental variables (2SLS) regression

      Source |       SS           df       MS      Number of obs   =        94
-------------+----------------------------------   F(7, 86)        =      3.33
       Model |  7.41348071         7  1.05906867   Prob > F        =    0.0034
    Residual |  47.8258916        86  .556115019   R-squared       =    0.1342
-------------+----------------------------------   Adj R-squared   =    0.0637
       Total |  55.2393723        93  .593971745   Root MSE        =    .74573

------------------------------------------------------------------------------
     ltotqty |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      lprice |  -1.327654   .4357373    -3.05   0.003    -2.193872   -.4614374
         mon |   -.403454   .2466969    -1.64   0.106    -.8938712    .0869632
        tues |  -.7084423   .2430651    -2.91   0.005     -1.19164    -.225245
         wed |  -.5335099   .2390388    -2.23   0.028    -1.008703   -.0583164
       thurs |   .1405286   .2391879     0.59   0.558    -.3349612    .6160185
           t |  -.0199943   .0125704    -1.59   0.115    -.0449835     .004995
          t2 |   .0001729    .000118     1.47   0.146    -.0000616    .0004074
       _cons |   8.455177    .285692    29.60   0.000      7.88724    9.023113
------------------------------------------------------------------------------
Instrumented:  lprice
Instruments:   mon tues wed thurs t t2 wave2 wave3
------------------------------------------------------------------------------

. clear

. use "/Users/ulaseraslan/Desktop/CRIMEEXAM.dta"

. sum crmrte prbarr prbconv prbpris avgsen polpc density west central urban pctmin80 wcon wtuc wtrd wf
> ir wser wmfg wfed wsta wloc pctymle

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      crmrte |        630    .0315876    .0181209   .0018116    .163835
      prbarr |        630    .3073682    .1712047   .0588235       2.75
     prbconv |        630    .6886176    1.690345   .0683761         37
     prbpris |        630    .4255184    .0872452    .148936    .678571
      avgsen |        630     8.95454    2.658082       4.22      25.83
-------------+---------------------------------------------------------
       polpc |        630    .0019168    .0027349   .0004585   .0355781
     density |        630    1.386062    1.439703   .1977186   8.827652
        west |        630    .2333333    .4232887          0          1
     central |        630    .3777778    .4852169          0          1
       urban |        630    .0888889    .2848094          0          1
-------------+---------------------------------------------------------
    pctmin80 |        630    25.71285    16.90354    1.28365    64.3482
        wcon |        630    245.6661    121.9837   65.62158   2324.598
        wtuc |        630    406.1028    266.5138    28.8577   3041.958
        wtrd |        630    192.8231    88.40727   16.87376   2242.747
        wfir |        630    272.0593    55.76809    3.51568   509.4655
-------------+---------------------------------------------------------
        wser |        630    224.6705    104.8667   1.843794   2177.068
        wmfg |        630    285.1701    82.36807     101.83     646.85
        wfed |        630    403.8959    63.06669      255.4     597.95
        wsta |        630    296.9075    53.43161     173.02        548
        wloc |        630    257.9762    41.35802     163.59     388.09
-------------+---------------------------------------------------------
     pctymle |        630    .0889739    .0243493   .0621577   .2743584

. 
. g lcrmrte = log(crmrte)

. 
.  g lprbarr = log(prbarr)

. 
.  g lprbconv = log(prbconv)

. 
.  g lprbpris = log(prbpris)

. 
.  g lavgsen = log(avgsen)

. 
.  g lpolpc = log(polpc)

. 
.  g ldensity = log(density)

. 
.  g ltaxpc = log(taxpc)

. 
.  g lpctmin80 = log(pctmin80)

. 
.  g lwcon = log(wcon)

. 
.  g lwtuc = log(wtuc)

. 
.  g lwtrd = log(wtrd)

. 
.  g lwfir = log(wfir)

. 
.  g lwser = log(wser)

. 
.  g lwmfg = log(wmfg)

. 
.  g lwfed = log(wfed)

. 
.  g lwsta = log(wsta)

. 
.  g lwloc = log(wloc)

.  
.  g lpctymle = log(pctymle)

. 
.  g lmix = log(mix)

. 
. 
. xtset county year
       panel variable:  county (strongly balanced)
        time variable:  year, 81 to 87
                delta:  1 unit

. reg lcrmrte lprbarr lprbconv lprbpris lavgsen lpolpc ldensity lpctmin80 lwcon lwtuc lwtrd lwfir lwse
> r lwmfg lwfed lwsta lwloc lpctymle west central urban i.year

      Source |       SS           df       MS      Number of obs   =       630
-------------+----------------------------------   F(26, 603)      =    101.65
       Model |   168.03904        26     6.46304   Prob > F        =    0.0000
    Residual |  38.3413024       603  .063584249   R-squared       =    0.8142
-------------+----------------------------------   Adj R-squared   =    0.8062
       Total |  206.380342       629  .328108652   Root MSE        =    .25216

------------------------------------------------------------------------------
     lcrmrte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lprbarr |  -.5373019   .0295517   -18.18   0.000    -.5953387   -.4792651
    lprbconv |  -.4305394    .021541   -19.99   0.000    -.4728439   -.3882348
    lprbpris |  -.1158175      .0485    -2.39   0.017    -.2110668   -.0205682
     lavgsen |     -.0907   .0401314    -2.26   0.024    -.1695142   -.0118858
      lpolpc |   .3601124   .0222813    16.16   0.000      .316354    .4038708
    ldensity |   .2994077   .0283729    10.55   0.000      .243686    .3551293
   lpctmin80 |   .1787638   .0195357     9.15   0.000     .1403975    .2171301
       lwcon |   .0852942   .0545355     1.56   0.118    -.0218084    .1923967
       lwtuc |    .021606   .0312172     0.69   0.489    -.0397016    .0829136
       lwtrd |   .0430638    .062275     0.69   0.490    -.0792384     .165366
       lwfir |  -.0018835   .0446601    -0.04   0.966    -.0895918    .0858248
       lwser |  -.0265476   .0312174    -0.85   0.395    -.0878556    .0347603
       lwmfg |   -.079091   .0528722    -1.50   0.135     -.182927     .024745
       lwfed |   .0842811    .113893     0.74   0.460    -.1393941    .3079563
       lwsta |   -.201884   .0930241    -2.17   0.030    -.3845745   -.0191935
       lwloc |   .0554338   .1399882     0.40   0.692    -.2194898    .3303574
    lpctymle |  -.1447863   .0631831    -2.29   0.022     -.268872   -.0207006
        west |  -.2287133   .0459447    -4.98   0.000    -.3189445   -.1384822
     central |  -.1783897    .027608    -6.46   0.000    -.2326092   -.1241702
       urban |  -.1364731   .0536989    -2.54   0.011    -.2419327   -.0310136
             |
        year |
         82  |  -.0014061   .0403917    -0.03   0.972    -.0807315    .0779193
         83  |   -.084797   .0443643    -1.91   0.056    -.1719244    .0023304
         84  |  -.1241425   .0464421    -2.67   0.008    -.2153503   -.0329347
         85  |  -.1114031   .0549531    -2.03   0.043    -.2193258   -.0034804
         86  |  -.0837597   .0631076    -1.33   0.185    -.2076971    .0401777
         87  |  -.0496623   .0708925    -0.70   0.484    -.1888885    .0895639
             |
       _cons |  -2.720805   .9660959    -2.82   0.005    -4.618126   -.8234835
------------------------------------------------------------------------------

. xtreg lcrmrte lprbarr lprbconv lprbpris lavgsen lpolpc ldensity lpctmin80 lwcon lwtuc lwtrd lwfir lw
> ser lwmfg lwfed lwsta lwloc lpctymle west central urban, fe
note: lpctmin80 omitted because of collinearity
note: west omitted because of collinearity
note: central omitted because of collinearity
note: urban omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        630
Group variable: county                          Number of groups  =         90

R-sq:                                           Obs per group:
     within  = 0.4251                                         min =          7
     between = 0.5442                                         avg =        7.0
     overall = 0.5330                                         max =          7

                                                F(16,524)         =      24.22
corr(u_i, Xb)  = -0.1918                        Prob > F          =     0.0000

------------------------------------------------------------------------------
     lcrmrte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lprbarr |  -.3849533   .0325051   -11.84   0.000    -.4488097    -.321097
    lprbconv |  -.3006001   .0212478   -14.15   0.000    -.3423414   -.2588588
    lprbpris |  -.1913185   .0325634    -5.88   0.000    -.2552893   -.1273477
     lavgsen |   .0261132   .0252498     1.03   0.302    -.0234899    .0757164
      lpolpc |   .4240881   .0269584    15.73   0.000     .3711283    .4770478
    ldensity |   .4087085   .2793557     1.46   0.144    -.1400862    .9575033
   lpctmin80 |          0  (omitted)
       lwcon |  -.0339735    .039211    -0.87   0.387    -.1110036    .0430565
       lwtuc |   .0294041   .0177622     1.66   0.098    -.0054897    .0642979
       lwtrd |  -.0385086   .0411672    -0.94   0.350    -.1193817    .0423645
       lwfir |   -.012934   .0287878    -0.45   0.653    -.0694877    .0436197
       lwser |   .0037358   .0194079     0.19   0.847    -.0343911    .0418626
       lwmfg |  -.3876171   .1022947    -3.79   0.000    -.5885752   -.1866591
       lwfed |  -.5533007   .1645185    -3.36   0.001    -.8764975   -.2301039
       lwsta |    .216229   .1007686     2.15   0.032     .0182689     .414189
       lwloc |   .3414363   .1067313     3.20   0.001     .1317624    .5511102
    lpctymle |   .3814478   .3245142     1.18   0.240    -.2560607    1.018956
        west |          0  (omitted)
     central |          0  (omitted)
       urban |          0  (omitted)
       _cons |   1.794691   .6892119     2.60   0.009     .4407333    3.148649
-------------+----------------------------------------------------------------
     sigma_u |  .37867244
     sigma_e |  .14048878
         rho |  .87900994   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(89, 524) = 34.86                    Prob > F = 0.0000

. reg lpolpc ltaxpc lprbarr lprbconv lprbpris lavgsen ldensity lpctmin80 lwcon lwtuc lwtrd lwfir lwser
>  lwmfg lwfed lwsta lwloc pctymle west central urban i.year

      Source |       SS           df       MS      Number of obs   =       630
-------------+----------------------------------   F(26, 603)      =     10.51
       Model |  54.4218436        26  2.09314783   Prob > F        =    0.0000
    Residual |  120.040299       603  .199071807   R-squared       =    0.3119
-------------+----------------------------------   Adj R-squared   =    0.2823
       Total |  174.462143       629  .277364297   Root MSE        =    .44617

------------------------------------------------------------------------------
      lpolpc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ltaxpc |   .5475183   .0816168     6.71   0.000     .3872306     .707806
     lprbarr |    .298103   .0509209     5.85   0.000     .1980991    .3981069
    lprbconv |   .3527329   .0352909    10.00   0.000     .2834248    .4220409
    lprbpris |   .0413357   .0863289     0.48   0.632    -.1282061    .2108774
     lavgsen |  -.0311069   .0711065    -0.44   0.662    -.1707533    .1085395
    ldensity |   .0293656   .0512578     0.57   0.567    -.0712999    .1300311
   lpctmin80 |   -.069771   .0345214    -2.02   0.044    -.1375677   -.0019742
       lwcon |  -.3623487   .0956468    -3.79   0.000    -.5501901   -.1745073
       lwtuc |   .0321155   .0553062     0.58   0.562    -.0765006    .1407316
       lwtrd |   .1196534   .1104373     1.08   0.279     -.097235    .3365418
       lwfir |  -.0553394    .079049    -0.70   0.484    -.2105843    .0999054
       lwser |  -.0013289    .055279    -0.02   0.981    -.1098916    .1072338
       lwmfg |   .1364137   .0961761     1.42   0.157     -.052467    .3252944
       lwfed |   .8873338   .2017922     4.40   0.000     .4910329    1.283635
       lwsta |    .229566   .1627078     1.41   0.159    -.0899768    .5491088
       lwloc |  -.2066971   .2474598    -0.84   0.404    -.6926848    .2792907
     pctymle |   4.517176   .8754929     5.16   0.000     2.797791    6.236562
        west |   .1259937   .0842667     1.50   0.135    -.0394982    .2914856
     central |    .065504   .0491041     1.33   0.183    -.0309318    .1619398
       urban |   .1946473   .1009279     1.93   0.054    -.0035657    .3928602
             |
        year |
         82  |  -.0906482   .0715835    -1.27   0.206    -.2312314    .0499351
         83  |  -.1085169    .078576    -1.38   0.168    -.2628327     .045799
         84  |  -.1430127   .0834101    -1.71   0.087    -.3068222    .0207969
         85  |  -.2325772   .0998299    -2.33   0.020    -.4286337   -.0365206
         86  |   -.274006   .1143475    -2.40   0.017    -.4985738   -.0494383
         87  |   -.255569   .1289454    -1.98   0.048    -.5088057   -.0023323
             |
       _cons |  -12.47162   1.710071    -7.29   0.000    -15.83004   -9.113205
------------------------------------------------------------------------------

. xi:ivreg lcrmrte lprbarr lprbconv lprbpris lavgsen ldensity lpctmin80 lwcon lwtuc lwtrd lwfir  lwser
>  lwmfg lwfed lwsta lwloc pctymle west central urban i.year (lpolpc = ltaxpc)
i.year            _Iyear_81-87        (naturally coded; _Iyear_81 omitted)

Instrumental variables (2SLS) regression

      Source |       SS           df       MS      Number of obs   =       630
-------------+----------------------------------   F(26, 603)      =     91.99
       Model |  167.930754        26  6.45887516   Prob > F        =    0.0000
    Residual |  38.4495883       603  .063763828   R-squared       =    0.8137
-------------+----------------------------------   Adj R-squared   =    0.8057
       Total |  206.380342       629  .328108652   Root MSE        =    .25252

------------------------------------------------------------------------------
     lcrmrte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      lpolpc |   .3473331   .0843652     4.12   0.000     .1816479    .5130184
     lprbarr |  -.5306976   .0372093   -14.26   0.000    -.6037732    -.457622
    lprbconv |  -.4240675   .0357648   -11.86   0.000    -.4943061   -.3538289
    lprbpris |  -.1116797   .0485416    -2.30   0.022    -.2070107   -.0163486
     lavgsen |  -.0911962   .0404257    -2.26   0.024    -.1705885   -.0118038
    ldensity |    .297579   .0286892    10.37   0.000     .2412361     .353922
   lpctmin80 |   .1772669   .0208862     8.49   0.000     .1362484    .2182853
       lwcon |    .079919   .0610594     1.31   0.191     -.039996    .1998339
       lwtuc |   .0232905   .0316061     0.74   0.461     -.038781    .0853619
       lwtrd |   .0473707   .0624633     0.76   0.449    -.0753015    .1700428
       lwfir |  -.0039467   .0452201    -0.09   0.930    -.0927548    .0848614
       lwser |  -.0278799   .0312796    -0.89   0.373    -.0893101    .0335504
       lwmfg |  -.0787704   .0585668    -1.34   0.179      -.19379    .0362492
       lwfed |   .0945845    .131013     0.72   0.471    -.1627128    .3518818
       lwsta |  -.2171807   .0936002    -2.32   0.021    -.4010027   -.0333587
       lwloc |   .0585213   .1410652     0.41   0.678    -.2185175    .3355601
     pctymle |  -.9242078   .5768261    -1.60   0.110     -2.05704    .2086244
        west |  -.2267908   .0460209    -4.93   0.000    -.3171716     -.13641
     central |  -.1762738   .0277424    -6.35   0.000    -.2307572   -.1217903
       urban |  -.1292964   .0650967    -1.99   0.047    -.2571402   -.0014526
   _Iyear_82 |  -.0001838    .040736    -0.00   0.996    -.0801854    .0798178
   _Iyear_83 |  -.0830487   .0449485    -1.85   0.065    -.1713234     .005226
   _Iyear_84 |  -.1201493   .0466828    -2.57   0.010    -.2118298   -.0284687
   _Iyear_85 |  -.1055032   .0553933    -1.90   0.057    -.2142904    .0032841
   _Iyear_86 |  -.0750468   .0634896    -1.18   0.238    -.1997344    .0496408
   _Iyear_87 |  -.0375355   .0707122    -0.53   0.596    -.1764076    .1013367
       _cons |  -2.330806   1.313883    -1.77   0.077     -4.91115    .2495368
------------------------------------------------------------------------------
Instrumented:  lpolpc
Instruments:   lprbarr lprbconv lprbpris lavgsen ldensity lpctmin80 lwcon
               lwtuc lwtrd lwfir lwser lwmfg lwfed lwsta lwloc pctymle west
               central urban _Iyear_82 _Iyear_83 _Iyear_84 _Iyear_85
               _Iyear_86 _Iyear_87 ltaxpc
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/ulaseraslan/Desktop/ulaseraslan_25058_final.log
  log type:  text
 closed on:  29 Jan 2021, 01:46:28
------------------------------------------------------------------------------------------------------
